/* eslint-disable no-irregular-whitespace */
export const courseData = [
  {
    key: '0000',
    val: () => ({
      title: 'test course',
    }),
  },
  {
    key: '0001',
    val: () => ({
      title: 'Grammar and Vocabulary',
      subTitle: 'Pre-intermediate to intermediate',
    }),
  },
];

export const lessonData = [
  {
    key: '0001-0000',
    courseId: '0001',
    val: () => ({
      name: 'Introduction',
      content: `Введение



      Основная задача пособия

      «Macmillan Exax Skills For Russia: Grammar and Vocabulary» состоит в том, чтобы помочь
      учащимся подготовиться к сдаче экзаменов по английскому языку в формате ЕГЗ и на уровень В2
      (Уаптаде) общеевропейской системы оценки владения иностранным языком (Соттоп Еигореап
      РгаглемогКк 5са!е). Пособие включает теоретический материал и практические упражнения по тем
      разделам лексики и грамматики, которые входят во все основные части экзамена на уровень В2
      общеевропейской системы оценки и в единый государственный экзамен по английскому языку.
      Пособие состоит из 28 уроков, каждый из которых включает в себя задания на развитие
      лексических и грамматических навыков.

      Грамматические разделы

      Грамматический раздел начинается ‹ теоретической части (две первых страницы каждого раздела),
      в которой в простой и доступной форме объясняются грамматические явления. Наиболее сложные
      грамматические явления выделены в рубрике «Watch Out»

      Вторая часть грамматического раздела включает в себя разнообразные по форме и сложности
      задания в формате ЕГЭ, направленные на повторение и закрепление пройденного материала.

      Лексические разделы

      Тематически организованные лексические разделы пособия включают в себя все типы заданий.
      соответствующие требованиям ЕГЭ и экзамена на уровень В2. Каждый раздел начинается с
      введения лексического материала, организованного в форме таблицы, которая состоит из пяти
      частей: лексические единицы по изучаемой тематике с объяснением значения слова и особенностей
      его употребления в речи: фразовые глаголы; устойчивые словосочетания: речевые образцы и
      словообразование.

      Лексические упражнения различной сложности в формате ЕГЭ и экзамена на уровень В2
      обеспечивают тщательную отработку и закрепление материала раздела.

      Каждый лексический раздел построен на грамматическом материале предыдущего раздела, что
      способствует повторению и автоматизации навыков употребления ранее пройденных
      грамматических структур.

      Повторение и закрепление пройденного материала

      Особое внимание в пособии «Macmillan Exax Skills For Russia: Grammar and Vocabulary»

      уделяется повторению и закреплению пройденного материала. Пособие включает:

      ® 14 разделов на повторение пройденного материала

      ® 2 теста на проверку степени усвоения пройденного материала (после разделов 14 и 28)

      ® 7 тестов на повторение пройденного материала (после каждого четвертого раздела),
      представленных в книге для учителя

      ® задания в формате единого государственного экзамена

      Дополнительные материалы

      Дополнительные справочные материалы, размещенные в конце пособия, включают

      ® список наиболее часто употребляемых неправильных глаголов

      ® список активной лексики по каждому разделу с объяснением значений слов и примерами их
      употребления, взятыми из Macmillan Essential Dictionary

      список фразовых глаголов с объяснениями значений и примерами их употреблений в речи
      список устойчивых словосочетаний

      справочные материалы по сочетаемости слов

      справочные материалы по словообразованию
      `,
    }),
  },
  {
    key: '0001-0001',
    courseId: '0001',
    val: () => ({
      name: 'Unit 1',
      subject: 'Grammar',
      description: 'Presebt time: present simple, present continuous, present perfect simple, present perfect continuos, stative verbs',
    }),
  },
  {
    key: '0001-0002',
    courseId: '0001',
    val: () => ({
      name: 'Unit 2',
      subject: 'Vocabulary',
      description: 'Travel and transport',
    }),
  },
  {
    key: '0001-0003',
    courseId: '0001',
    val: () => ({
      name: 'Unit 3',
      subject: 'Grammar',
      description: 'Present simple, present continues, stative verbs',
    }),
  },
  {
    key: '0001-0001',
    courseId: '0001',
    val: () => ({
      name: 'Unit 1',
      subject: 'Grammar',
      description: 'Present simple, present continues, stative verbs',
    }),
  },
  {
    key: '0001-0001',
    courseId: '0001',
    val: () => ({
      name: 'Unit 1',
      subject: 'Grammar',
      description: 'Present simple, present continues, stative verbs',
    }),
  },
  {
    key: '0001-0001',
    courseId: '0001',
    val: () => ({
      name: 'Unit 1',
      subject: 'Grammar',
      description: 'Present simple, present continues, stative verbs',
    }),
  },
  {
    key: '0001-0001',
    courseId: '0001',
    val: () => ({
      name: 'Unit 1',
      subject: 'Grammar',
      description: 'Present simple, present continues, stative verbs',
    }),
  },
  {
    key: '0001-0001',
    courseId: '0001',
    val: () => ({
      name: 'Unit 1',
      subject: 'Grammar',
      description: 'Present simple, present continues, stative verbs',
    }),
  },
];
